
Процедура КнопкаВыполнитьНажатие(Кнопка)
	ИндексСтрокиТаблицыЦен = 0;
	Организация = Справочники.Организации.НайтиПоКоду("000000001");
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр    = "Табличный документ Excel (*.xlsx)|*.xlsx|(*.xls)|*.xls|";
		
		Если ДиалогВыбораФайла.Выбрать() Тогда		
			ФайлНаДиске = Новый Файл(ДиалогВыбораФайла.ПолноеИмяФайла);
			Если нРег(ФайлНаДиске.Расширение) = ".xls" ИЛИ нРег(ФайлНаДиске.Расширение) = ".xlsx"Тогда		
				мПрочитатьТабличныйДокументИзExcel(ДиалогВыбораФайла.ПолноеИмяФайла);
			иначе
				сообщить("К сожалению, я не понимаю этот формат");
			КонецЕсли;	
		КонецЕсли;

КонецПроцедуры
Функция мПрочитатьТабличныйДокументИзExcel(ИмяФайла)
Сообщить(" Начало загрузки " + ТекущаяДата()); 	
	ДатаСтарт = ТекущаяДата();
	Цена = 0;ЦенаЗак = 0;Количество = 0; Склад = "";Поставщик = "";КодТовара=0;
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		Сообщить("Файл не существует!");
		Возврат Ложь;
	КонецЕсли;
 	XLS = ПолучитьCOMОбъект(ИмяФайла);
	целл = 2;
	Пока ЗначениеЗаполнено(xls.Sheets(1).Cells(целл,2).Value) Цикл   	
	//Пока целл < 15 Цикл  
	
		КодПост = "";
		ОбработкаПрерыванияПользователя(); 
		Состояние("Строка Excel " + целл);
		Поставщик    = СокрЛП(xls.Sheets(1).Cells(целл,2).Text);
		КодТовара    = СокрЛП(xls.Sheets(1).Cells(целл,1).Text);
		Скидка     = СокрЛП(xls.Sheets(1).Cells(целл,4).Text);
		Наименование = СокрЛП(xls.Sheets(1).Cells(целл,1).Text);
		Комментарий      = СокрЛП(xls.Sheets(1).Cells(целл,3).Text);
		Паспорт = СокрЛП(xls.Sheets(1).Cells(целл,5).Text);

		ГрупКонтр = Справочники.Контрагенты.НайтиПоНаименованию("Клиенты с Дисконтными картами");
		Если СокрЛП(ГрупКонтр.Наименование) = "" Тогда
			ГрупКонтр = Справочники.Контрагенты.СоздатьГруппу();
			//ГрупКонтр.ЭтоГруппа = Истина;
			ГрупКонтр.Наименование = "Клиенты с Дисконтными картами";
			ГрупКонтр.Код = "000002600";
			ГрупКонтр.Записать();
		КонецЕсли;  		

		
		Контр = Справочники.Контрагенты.НайтиПоНаименованию(Поставщик);	   	
		Если СокрЛП(Контр.Наименование) = "" Тогда  
			Запрос = Новый Запрос();
			Запрос.УстановитьПараметр("НаименованиеПолное", Поставщик);
			Запрос.Текст = "ВЫБРАТЬ
			|	Контрагенты.Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.НаименованиеПолное ПОДОБНО &НаименованиеПолное";
 
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				Сообщить("Создаю Контрагент " + Поставщик);
				Контр = Справочники.Контрагенты.СоздатьЭлемент();	
			 	Контр.Наименование = Поставщик;
				Контр.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
				Контр.НаименованиеПолное = Поставщик + ", " + Комментарий;    			 
				Контр.Комментарий = Паспорт;
				Контр.Родитель = ГрупКонтр;
				Контр.Покупатель = Истина;
				Контр.Записать();        	
			
            Иначе 
				Выборка1 = РезультатЗапроса.Выбрать();
				Пока Выборка1.Следующий() Цикл 
					Контр = Выборка1.Ссылка;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		Карта = Справочники.ИнформационныеКарты.СоздатьЭлемент();
		НаимД = "Дисконт " + Скидка ;
		ВидДисконтнойКарты = Справочники.ВидыДисконтныхКарт.НайтиПоНаименованию(НаимД);
		Если СокрЛП(ВидДисконтнойКарты.Наименование) = "" Тогда
			ВидДисконтнойКарты = Справочники.ВидыДисконтныхКарт.СоздатьЭлемент();
			ВидДисконтнойКарты.Наименование = НаимД;
			ВидДисконтнойКарты.Записать();
		КонецЕсли;
		Карта.Наименование = КодТовара;
		Карта.ВидДисконтнойКарты = ВидДисконтнойКарты;
		Карта.ВидКарты = Перечисления.ВидыИнформационныхКарт.Магнитная;
		Карта.ТипКарты = Перечисления.ТипыИнформационныхКарт.Дисконтная;  	
		Карта.ВладелецКарты = Контр;
		Карта.Родитель = Контр;
		Карта.КодКарты =Паспорт ;
		Карта.Записать();   			
		целл = целл +1;
	КонецЦикла;
	
КонецФункции // мПрочитатьТабличныйДокументИзExcel()
		   